---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewScaleHavename
source: html/6ea68b19-22cc-501f-0ff1-70b04b45c94d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewScaleHavename Property

"Display Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewScaleHavename { get; }
```